<?php
// 以下をfor文を使用して表示してください。
// ヒント: forの中でforを３回使用

// ***1
// **121
// *12321
// 1234321

// for ($i = 1; $i >= 5; $i++) {
//     for ($j = 4; $j >= $i; $j++) {
//         for ($k = 3; $k >= 0; $k--) {
//             echo "*";
//         }
//         echo $j-$i;
//     }
//     echo "<br>";
// }

for ($i = 1; $i <= 4; $i++) {
    for ($j = 3; $j >= $i; $j--) {
        echo "*";
    }
    for ($k = 1; $k <= $i; $k++) {
        echo $k;
    }
    // print "(i:".$i." j:".$j." k:".$k.")";
    for ($l = 3; $l >= 6-$k; $l--) {
        echo $l-(4-$i);
    }
    echo "<br>";
}
